Revit 2027 API
ExternalServices.BuiltInExternalServices.ConnectionTypeChangedService Property
 The external service used to notify when structural connection changed the type.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ConnectionTypeChangedService { get; }
Public Shared ReadOnly Property ConnectionTypeChangedService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ConnectionTypeChangedService {
	ExternalServiceId^ get ();
}
static member ConnectionTypeChangedService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace